/*
[플랫폼]
프로그래머스

[난이도]
레벨 1

[문제]
최대공약수와 최소공배수

[링크]
https://programmers.co.kr/learn/courses/30/lessons/12940
*/

// 첫번째 풀이 -----------------------------------------------------------------------------------------------

function solution(n, m) {
  let min = Math.min(n, m);

  for (let i = min; i > 0; i--) {
    if (!(n % i) && !(m % i)) {
      return [i, (n * m) / i];
    }
  }
}

// 두번째 풀이 -----------------------------------------------------------------------------------------------

function solution(n, m) {
  var r;
  for (var nm = n * m; (r = n % m); n = m, m = r) {}
  return [m, nm / m];
}

/*
- 주어지는 두 수(n, m)와 최대공약수(g), 최소공배수(l)의 관계는 nm = gl
- for문을 저렇게도 사용할 수 있다니........
*/
