/*
[플랫폼]
프로그래머스

[난이도]
레벨 1

[문제]
문자열을 정수로 바꾸기

[테스트 날짜]
22.05.25

[링크]
https://programmers.co.kr/learn/courses/30/lessons/12925
*/

// 첫번째 풀이 -----------------------------------------------------------------------------------------------

function solution(s) {
  return Number(s);
}

// 두번째 풀이 -----------------------------------------------------------------------------------------------

function solution(s) {
  return s / 1;
}

// 세번째 풀이 -----------------------------------------------------------------------------------------------

function solution(s) {
  return +s;
}

/*
★★★ 배운 점 ★★★
- 속도가 가장 빠른 풀이는 두번째
*/
