/*
[플랫폼]
프로그래머스

[난이도]
레벨 1

[문제]
문자열 내림차순으로 배치하기

[테스트 날짜]
22.05.05

[링크]
https://programmers.co.kr/learn/courses/30/lessons/12917
*/

// 첫번째 풀이 -----------------------------------------------------------------------------------------------

function solution(s) {
  return s
    .split("")
    .sort((a, b) => b.charCodeAt(0) - a.charCodeAt(0))
    .join("");
}

// 두번째 풀이 -----------------------------------------------------------------------------------------------

function solution(s) {
  return s
    .split("")
    .sort((a, b) => (a < b ? 1 : -1))
    .join("");
}
// 세번째 풀이 -----------------------------------------------------------------------------------------------

function solution(s) {
  return s.split("").sort().reverse().join("");
}
